Repository: 1chen23224/demo1
Catalog: CodeQuest/language/*.lproj/Localizable.strings
Languages: pt_pt

# tab_study
source: Study
pt_pt: Estudar

# tab_wrong
source: Wrong
pt_pt: Errada

# tab_review
source: Review
pt_pt: Revisão

# tab_contact
source: Contact
pt_pt: Contato

# guide_tap_to_start
source: Tap here to start
pt_pt: Toque aqui para começar

# contact_alert_title
source: Contact Us Anytime
pt_pt: Contate-nos a qualquer momento

# contact_alert_message
source: Our Instagram: @full_score_top
pt_pt: Nosso Instagram: @full_score_top

# contact_alert_button_ig
source: Open IG
pt_pt: Abrir IG

# contact_alert_button_cancel
source: Cancel
pt_pt: Cancelar

# fast_start
source: Pure
pt_pt: Pura

# secret_alert_title
source: Open Sesame!!
pt_pt: Abre-te Sésamo!!

# secret_alert_placeholder
source: Enter secret code...
pt_pt: Digite o código secreto...

# secret_alert_button_cancel
source: Cancel
pt_pt: Cancelar

# secret_alert_button_confirm
source: Confirm
pt_pt: Confirmar

# secret_alert_message
source: Tap the title 5 times to summon coco.
pt_pt: Toque no título 5 vezes para invocar coco.

# select_language_title
source: Select your language
pt_pt: Selecione seu idioma

# click2start
source: Touch start
pt_pt: Iniciar por toque

# acceptnagree
source: I have read and agreed
pt_pt: Eu li e concordo

source: Terms of use
pt_pt: Termos de utilização

# terms
source: 1. Copyright and Ownership All content contained in this application (including but not limited to text, images, graphics, and designs), unless otherwise stated, belongs to its original copyright holders and is protected by copyright laws and international treaties. Users may not commercially exploit, redistribute, or reproduce this content in any form without explicit written authorization. 2. Content Sources and Use Some of the content in this application is sourced from the public materials of the “Driving Theory Test” published by the Macao Special Administrative Region Transport Bureau (www.dsat.gov.mo). 3. User Responsibilities By using this application, you agree to abide by all terms of use and guarantee that you will not use the content of this application for any illegal or improper purposes. You agree not to modify, redistribute, or commercialize the application content unless you have obtained proper authorization. 4. Disclaimer All content of this application is provided “as is.” The developer does not guarantee the accuracy, completeness, or reliability of the content and assumes no responsibility for any damages or losses resulting from the use of the application content. The application is not responsible for links to external websites or services. 5. Privacy and Data Protection We respect and protect your privacy. This application is a standalone game and therefore does not collect, store, or share your personal data. We will not request or access any information related to your device, location, contacts, or gameplay. You are not required to provide any personal information when using this application, and the application will not provide any of your data to third parties. If there are any changes to the privacy policy, we will notify you in a timely manner and update the terms. 6. Changes and Updates We reserve the right to modify or update these Terms of Use at any time. When the terms are changed, a notice will be published within the application and on relevant pages, indicating the update date.
pt_pt: 1. Direitos de Autor e Propriedade Todo o conteúdo incluído nesta aplicação (incluindo, mas não se limitando a texto, imagens, gráficos e design), salvo indicação em contrário, pertence aos respetivos titulares originais dos direitos de autor e está protegido pelas leis de direitos de autor e tratados internacionais. Os utilizadores não podem explorar comercialmente, redistribuir ou reproduzir este conteúdo em qualquer forma sem autorização escrita explícita. 2. Fontes e Utilização de Conteúdos Parte do conteúdo desta aplicação tem origem em materiais públicos do “Exame Teórico de Condução” do Instituto para os Assuntos de Tráfego da Região Administrativa Especial de Macau (www.dsat.gov.mo). 3. Responsabilidades do Utilizador Ao utilizar esta aplicação, o utilizador concorda em cumprir todos os termos de uso e garante que não utilizará o conteúdo desta aplicação para quaisquer fins ilegais ou impróprios. O utilizador compromete-se a não modificar, redistribuir ou comercializar o conteúdo da aplicação, salvo se tiver obtido a devida autorização. 4. Declaração de Responsabilidade Todo o conteúdo desta aplicação é fornecido “tal como está”. O desenvolvedor não garante a exatidão, integridade ou fiabilidade do conteúdo e não se responsabiliza por quaisquer danos ou perdas resultantes da utilização do conteúdo da aplicação. A aplicação não assume qualquer responsabilidade por ligações a sites ou serviços externos. 5. Privacidade e Proteção de Dados Respeitamos e protegemos a sua privacidade. Esta aplicação é um jogo autónomo e, por isso, não recolhe, armazena nem partilha os seus dados pessoais. Não solicitamos nem acedemos a informações relacionadas com o seu dispositivo, localização, contactos ou processo de jogo. Não é necessário fornecer quaisquer dados pessoais para utilizar esta aplicação, e a aplicação não disponibilizará qualquer dos seus dados a terceiros. Caso haja alterações à política de privacidade, notificaremos atempadamente e atualizaremos os termos. 6. Alterações e Atualizações Reservamo-nos o direito de modificar ou atualizar estes Termos de Utilização a qualquer momento. Quando ocorrerem alterações, será publicada uma notificação dentro da aplicação e nas páginas relevantes, indicando a data da atualização.

# error_book
source: Error Guidebook
pt_pt: Guia de Erros

source: Tips
pt_pt: Dicas

# tips_1
source: You can swipe right to switch to the 'Review' page
pt_pt: Pode deslizar para a direita para mudar para a página de 'Revisão'

# tips_2
source: Got it
pt_pt: Entendi

# wrong_review
source: Wrong Answer Review
pt_pt: Revisão de Respostas Erradas

# chapter_title
source: Chapter %d
pt_pt: Capítulo %d

# wrong_play
source: Create a wrong-answer review stage
pt_pt: Criar uma etapa de revisão de erros

# wrong_clear
source: Are you sure you want to clear all wrong answers?
pt_pt: Tem a certeza de que deseja apagar todas as respostas erradas?

# wrong_alert
source: This action cannot be undone. Wrong-answer records will be deleted.
pt_pt: Esta ação não pode ser anulada. Os registos de respostas erradas serão eliminados.

source: Cancel
pt_pt: Cancelar

source: Clear
pt_pt: Apagar

source: Review
pt_pt: Revisão

# review_play
source: Create a full review stage
pt_pt: Criar uma etapa de revisão completa

# review_mock
source: Set as mock exam ratio
pt_pt: Definir como proporção de exame simulado

# no_question
source: There are currently no questions
pt_pt: Atualmente não há nenhuma questão

# search
source: Search for a question or answer
pt_pt: Pesquisar pergunta ou resposta

# chapter_total
source: %@: %d questions in total
pt_pt: %@: %d questões no total

# question_percentage
source: Question ratio: %d%%
pt_pt: Proporção das questões: %d%%

# chapter_board
source: Chapter %d Teaching Board
pt_pt: Quadro de Ensino do Capítulo %d

# select_an_img
source: Please select an image above to start the lesson
pt_pt: Por favor, selecione uma imagem acima para começar a lição

source: Pen Color
pt_pt: Cor da Caneta

source: Eraser
pt_pt: Borracha

# all_clear
source: Clear All
pt_pt: Limpar Tudo

# related_question_progress
source: Related Questions %d / %d
pt_pt: Perguntas Relacionadas %d / %d

# welcome_message
source: 🎇 Welcome to "Full Score Top" 🚗 Let's clear the stages and aim for a perfect score.
pt_pt: 🎇 Bem-vindo ao "Full Score Top" 🚗 Vamos passar as fases e apontar para a pontuação perfeita.

# welcome_message2
source: The "Summary" and "Guidebook" here are great helpers on your journey!
pt_pt: O "Resumo" e o "Guia" são ótimos ajudantes na sua jornada!

# welcome_message3
source: After completing a stage, you can review all incorrect answers in "Review Mistakes" on the main menu!
pt_pt: Após completar uma fase, pode rever todas as respostas incorretas em "Rever Erros" no menu principal!

# welcome_message4
source: Are you ready? Please click the first stage to begin your journey!
pt_pt: Está pronto? Por favor, clique na primeira fase para começar a sua jornada!

# welcome_message5
source: Here are the details of the stage, where you can see your best record.
pt_pt: Aqui estão os detalhes da fase, onde pode ver o seu melhor recorde.

# welcome_message6
source: Click "Start Challenge" to enter the stage immediately!
pt_pt: Clique em "Começar Desafio" para entrar imediatamente na fase!

source: Next
pt_pt: Seguinte

# boss_stage_title
source: -Chapter %d- Final Stage
pt_pt: -Capítulo %d- Fase Final

# normal_stage_title
source: -Chapter %d- Stage %d
pt_pt: -Capítulo %d- Fase %d

# summary_ch2_title_format
source: Chapter %d Summary
pt_pt: Resumo do Capítulo %d

# summary_ch2_sec1_heading
source: Basic Driving and Turning Rules
pt_pt: Regras Básicas de Condução e Viragem

# summary_ch2_sec1_item1
source: Picking Up/Dropping Off Passengers/Goods: Should be done on the left side of the road
pt_pt: **Embarque/Desembarque de Passageiros/Carga**: Deve ser feito no **lado esquerdo** da estrada

# summary_ch2_sec1_item2
source: Turning on a One-Way Street: Keep left when turning left, keep right when turning right
pt_pt: **Virar em Rua de Sentido Único**: **Mantenha-se à esquerda para virar à esquerda, mantenha-se à direita para virar à direita**

# summary_ch2_sec1_item3
source: Turning on a Two-Way Street: Keep left when turning left, turn right from the center line
pt_pt: **Virar em Rua de Duplo Sentido**: **Mantenha-se à esquerda para virar à esquerda, vire à direita a partir da linha central**

# summary_ch2_sec2_heading
source: Right-of-Way Priority (Yielding)
pt_pt: Prioridade de Passagem (Cedência de Passagem)

# summary_ch2_sec2_item1
source: Step 1: Look at the signs -> Vehicles with a Yield (▽) sign go last
pt_pt: **Passo 1: Olhar para os sinais** -> Veículos com um **sinal de Cedência de Passagem (▽)** passam em **último**

# summary_ch2_sec2_item2
source: Step 2: Look at the action -> Left-turning vehicles have priority
pt_pt: **Passo 2: Olhar para a manobra** -> **Veículos a virar à esquerda** têm prioridade

# summary_ch2_sec2_item3
source: Step 3: Look at the position -> Let vehicles on the left proceed first
pt_pt: **Passo 3: Olhar para a posição** -> Deixar os veículos da **esquerda** passar primeiro

# summary_ch2_sec2_item4
source: Judgment Flow (Combined): At intersections without traffic lights, judge in this order: Left-turning vehicle -> Vehicle that won't obstruct traffic (yield to the left) -> Vehicle with a yield sign
pt_pt: **Fluxo de Decisão (Combinado)**: Em cruzamentos sem semáforos, decida nesta ordem: **Veículo a virar à esquerda -> Veículo que não obstrui o trânsito (ceder à esquerda) -> Veículo com sinal de cedência de passagem**

# summary_ch2_sec2_item5
source: Start judging counter-clockwise from an empty entrance of the intersection; you can basically get the answer directly.
pt_pt: Comece a julgar no sentido anti-horário a partir de uma entrada vazia do cruzamento; basicamente, pode obter a resposta diretamente.

# summary_ch2_sec2_item6
source: Similarly, if you can identify which vehicle goes first, judging in a counter-clockwise direction from that vehicle will basically lead you directly to the answer.
pt_pt: Da mesma forma, se conseguir identificar qual veículo avança primeiro, julgar no sentido anti-horário a partir desse veículo levará basicamente à resposta correta.

# summary_ch2_sec2_item7
source: For T-intersection questions, you need to look at the road signs and determine the vehicles' paths.
pt_pt: Para questões sobre cruzamentos em T, é necessário observar os sinais de trânsito e determinar a trajetória dos veículos.

# summary_ch2_sec3_heading
source: Prohibited Actions Reminder
pt_pt: Lembrete de Ações Proibidas

# summary_ch2_sec3_item1
source: At an Intersection: You must not stop, park, overtake, make a U-turn, or reverse
pt_pt: **Num Cruzamento**: **Não deve** parar, estacionar, ultrapassar, fazer inversão de marcha ou marcha-atrás

# summary_ch2_sec3_item2
source: Yellow Dashed Line: You can stop to pick up/drop off, but you cannot park
pt_pt: **Linha Tracejada Amarela**: **Pode** parar para embarque/desembarque, mas **não pode** estacionar

# summary_ch2_sec3_item3
source: Yellow Solid Line: You must not stop or park
pt_pt: **Linha Contínua Amarela**: **Não deve** parar nem estacionar

# summary_ch3_title_format
source: Chapter %d Summary
pt_pt: Resumo do Capítulo %d

# summary_ch3_sec1_heading
source: Common Imprisonment/Suspension Periods
pt_pt: Períodos Comuns de Prisão/Suspensão

# summary_ch3_sec1_item1
source: One to three years
pt_pt: Um a três anos

# summary_ch3_sec1_item2
source: Two to six months
pt_pt: Dois a seis meses

# summary_ch3_sec1_item3
source: For repeat offenses, fine amount is doubled.
pt_pt: Para reincidentes, o valor da multa é duplicado.

# summary_ch3_sec2_heading
source: Specific Offense Fines
pt_pt: Multas por Infrações Específicas

# summary_ch3_sec2_item1
source: If options are only 300, 600, 900, 1500, 3000, prioritize selecting one of these.
pt_pt: Se as opções forem apenas 300, 600, 900, 1500, 3000, priorize a seleção de uma destas.

# summary_ch3_sec2_item2
source: Defective lights violation: $600
pt_pt: Infração por luzes defeituosas: $600

# summary_ch3_sec2_item3
source: Bridge violation: $900
pt_pt: Infração em ponte: $900

# summary_ch3_sec2_item4
source: Driving without a license: $5,000 to $25,000
pt_pt: Condução sem carta: $5,000 a $25,000

# summary_ch4_title_format
source: Chapter %d Summary
pt_pt: Resumo do Capítulo %d

# summary_ch4_sec1_heading
source: Core Principle of Fine Amounts
pt_pt: Princípio Central dos Valores das Multas

# summary_ch4_sec1_item1
source: In the written test, there are **only five fixed fine amounts: $300, $600, $900, $1500, $3000**.
pt_pt: No exame teórico, existem **apenas cinco valores de multa fixa: $300, $600, $900, $1500, $3000**.

# summary_ch4_sec1_item2
source: Options with other fixed amounts (e.g., $400, $500, $1000) can essentially be **ruled out immediately**!
pt_pt: Opções com outros valores fixos (ex: $400, $500, $1000) podem ser essencialmente **descartadas imediatamente**!

# summary_ch4_sec2_heading
source: Overview of the Five Key Fine Amounts
pt_pt: Visão Geral dos Cinco Valores Chave de Multas

# summary_ch4_sec2_item1
source: **$300 (Minor Offenses)**: Overloading, opening door carelessly, improper starting, stalling without signals, carrying passenger on a bicycle, pushing/driving on pavement, improper use of horn, sudden deceleration, improper lane entry, license/document issues.
pt_pt: **$300 (Infrações Leves)**: Sobrecarga, abertura descuidada da porta, arranque inadequado, motor ir abaixo sem sinalização, transportar passageiro em bicicleta, empurrar/conduzir no passeio, uso indevido da buzina, desaceleração súbita, entrada indevida na via, questões de licença/documentos.

# summary_ch4_sec2_item2
source: **$600 (Moderate Offenses)**: Improper loading/unloading, not parking on the left, helmet violations, P-plate violations, motorcycle offenses (hands off/riding abreast/towing), using a phone, environmental impact (smoke/noise), accelerating while being overtaken, obstructing another vehicle's overtaking.
pt_pt: **$600 (Infrações Moderadas)**: Carga/descarga inadequada, não estacionar à esquerda, infrações de capacete, infrações de placa 'P', infrações de motociclo (sem mãos/lado a lado/reboque), uso de telemóvel, impacto ambiental (fumo/ruído), acelerar ao ser ultrapassado, obstruir a ultrapassagem de outro veículo.

# summary_ch4_sec2_item3
source: **$900 (Affecting Traffic Flow)**: Improperly carrying a load, improper reversing or turning, not keeping left, obstructing oncoming traffic, overtaking on the left.
pt_pt: **$900 (Afetando o Fluxo de Trânsito)**: Transporte inadequado de carga, marcha-atrás ou viragem inadequadas, não se manter à esquerda, obstruir o trânsito em sentido contrário, ultrapassar pela esquerda.

# summary_ch4_sec2_item4
source: **$1500 (Dangerous Lighting)**: Improper use of **high beams**.
pt_pt: **$1500 (Iluminação Perigosa)**: Uso indevido de **luzes de máximos**.

# summary_ch4_sec2_item5
source: **$3000 (Serious Offenses)**: Overloading by **more than 20%**, carrying dangerous goods improperly, installing a **radar jamming device**.
pt_pt: **$3000 (Infrações Graves)**: Sobrecarga superior a **20%**, transporte inadequado de mercadorias perigosas, instalação de um **dispositivo de interferência de radar**.

# summary_ch4_sec3_heading
source: Quick Memory Tips (Mnemonics)
pt_pt: Dicas de Memorização Rápida (Mnemónicas)

# summary_ch4_sec3_item1
source: If options include 3000 and another four-digit number -> Choose **$3000**
pt_pt: Se as opções incluem 3000 e outro número de quatro dígitos -> Escolha **$3000**

# summary_ch4_sec3_item2
source: If options include 50 and 600 -> Choose **$600**
pt_pt: Se as opções incluem 50 e 600 -> Escolha **$600**

# summary_ch4_sec3_item3
source: If the highest option is 1000 -> Choose **$600**
pt_pt: Se a opção mais alta for 1000 -> Escolha **$600**

# summary_ch4_sec3_item4
source: If options are 200, 400, 600, 900 -> Choose **$900**
pt_pt: Se as opções forem 200, 400, 600, 900 -> Escolha **$900**

# summary_ch4_sec4_heading
source: Fine Combinations (Range Questions)
pt_pt: Combinações de Multas (Questões de Intervalo)

# summary_ch4_sec4_item1
source: **Priority Choice**: $600 - $2,500
pt_pt: **Escolha Prioritária**: $600 - $2,500

# summary_ch4_sec4_item2
source: **Priority Choice**: $2,000 - $10,000
pt_pt: **Escolha Prioritária**: $2,000 - $10,000

# summary_ch4_sec4_item3
source: **Priority Choice**: $4,000 - $20,000
pt_pt: **Escolha Prioritária**: $4,000 - $20,000

# summary_ch4_sec4_item4
source: If you see **'Repeat Offender'** -> **$1,200 - $5,000**
pt_pt: Se vir **'Reincidente'** -> **$1,200 - $5,000**

# summary_ch4_sec4_item5
source: Failing to give way on slip road -> **$1,000 - $5,000**
pt_pt: Não ceder passagem na via de acesso -> **$1,000 - $5,000**

# summary_ch4_sec4_item6
source: Note the pattern **'first number x 5 = second number'** (e.g., $6000 - $30000)
pt_pt: Note o padrão **'primeiro número x 5 = segundo número'** (ex: $6000 - $30000)

# summary_ch4_sec5_heading
source: Serious Offenses (Imprisonment/Heavy Penalties)
pt_pt: Infrações Graves (Prisão/Penas Pesadas)

# summary_ch4_sec5_item1
source: Hit-and-run: Up to **3 years** imprisonment
pt_pt: Fuga após acidente: Até **3 anos** de prisão

# summary_ch4_sec5_item2
source: Driving without a license: **6 months** imprisonment & **$10,000 - $50,000**
pt_pt: Condução sem carta: **6 meses** de prisão & **$10,000 - $50,000**

# summary_ch4_sec5_item3
source: Driving under the influence of drink or drugs (habitual): **1-3 years** imprisonment
pt_pt: Condução sob influência de álcool ou drogas (habitual): **1-3 anos** de prisão

source: Summary
pt_pt: Resumo

# no_summary
source: No summary available for this chapter yet.
pt_pt: Ainda não há resumo disponível para este capítulo.

# chapter_guidebook_title
source: Chapter %d Guidebook
pt_pt: Guia do Capítulo %d

# stage_final
source: Final Stage
pt_pt: Fase Final

# stage_with_number
source: Stage %d
pt_pt: Fase %d

# record_title
source: 👑 High Score
pt_pt: 👑 Recorde

# record_evaluation
source: Evaluation: %@
pt_pt: Avaliação: %@

# record_max_combo
source: Max Combo: %d
pt_pt: Combo Máximo: %d

# record_correct_questions
source: Correctly Answered: %d / %d
pt_pt: Respostas Corretas: %d / %d

# no_record
source: Not Yet Challenged
pt_pt: Ainda Não Desafiado

# game_start
source: Start Challenge
pt_pt: Começar Desafio

# question_progress_indicator
source: Question %d/%d
pt_pt: Pergunta %d/%d

# onboarding_tip_1
source: Here are your lives ❤️ and hints 💡. Answering incorrectly costs a life, hints can help you!
pt_pt: Estas são as tuas vidas ❤️ e dicas 💡. Responder incorretamente custa uma vida, as dicas podem ajudar-te!

# onboarding_tip_2
source: This is the question. Tap to show the image and observe carefully 🖼️
pt_pt: Esta é a pergunta. Toque para mostrar a imagem e observe com atenção 🖼️

# onboarding_tip_3
source: Choose the correct answer from here ✅ You'll know if you're right or wrong immediately after tapping
pt_pt: Escolha a resposta correta aqui ✅ Saberá imediatamente se está certo ou errado após tocar

# onboarding_tip_4
source: This shows the total questions and your current progress in this stage 🚗 The car needs to reach the finish line
pt_pt: Isto mostra o total de perguntas e o teu progresso atual nesta fase 🚗 O carro precisa de chegar à meta

# onboarding_tip_5
source: Answering correctly earns you points and combo bonuses 🎉 Answering incorrectly costs a life!
pt_pt: Responder corretamente dá-te pontos e bónus de combo 🎉 Responder incorretamente custa uma vida!

# stage_title_boss_format
source: Chapter %d Final Stage
pt_pt: Capítulo %d Fase Final

# stage_title_normal_format
source: Chapter %d Stage %d
pt_pt: Capítulo %d Fase %d

# all_complete
source: All questions completed!
pt_pt: Todas as perguntas concluídas!

source: Loading...
pt_pt: A carregar...
